package erpoge.language;

public class Russian extends Language {
	public Russian() {
		NUMBER_OF_CASES = 6;
		LANGUAGE_NAME = "Russian";
		addCharacterName("dragon", "дракон", "дракона", "дракону", "дракона",
				"драконом", "драконе");
		addCharacterName("goblin", "гоблин", "гоблина", "гоблину", "гоблина",
				"гоблином", "гоблине");
		addCharacterName("goblinMage", "гоблин-маг", "гоблина-мага",
				"гоблину-магу", "гоблина-мага", "гоблином-магом",
				"гоблине-маге");
		addCharacterName("dwarvenHooker", "дварфийска€ проститутка",
				"дварфийской проститутки", "дварфийской проститутке",
				"дварфийскую проститутку", "дварфийской проституткой",
				"дварфийской проститутке");
		addCharacterName("innkeeper", "дварфийска€ проститутка",
				"дварфийской проститутки", "дварфийской проститутке",
				"дварфийскую проститутку", "дварфийской проституткой",
				"дварфийской проститутке");
		addCharacterName("ogre", "огр",
				"огра", "огру",
				"огра", "огром",
				"огре");
	}
}
